basic.xml
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE tsung SYSTEM "@prefix@/share/@PACKAGE_NAME@/@DTD@">
<tsung loglevel="debug">
  <clients>
    <client host="localhost" use_controller_vm="true"/>
  </clients>

  <servers>
    <server host="example.com" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="60" unit="second">
      <users arrivalrate="200" unit="second"></users>
    </arrivalphase>
  </load>

  <sessions>
    <session name="example" probability="100" type="ts_http">
      <request subst="true">
        <http url="/" method="GET">
        </http>
      </request>
    </session>
  </sessions>
</tsung>